const province_city = {"北京市": ["北京市"],"天津市": ["天津市"],"河北省": ["石家庄市","唐山市","秦皇岛市","邯郸市","邢台市","保定市","张家口市","承德市","沧州市","廊坊市","衡水市"],"山西省": ["太原市","大同市","阳泉市","长治市","晋城市","朔州市","晋中市","运城市","忻州市","临汾市","吕梁市"],"内蒙古自治区": ["呼和浩特市","包头市","乌海市","赤峰市","通辽市","鄂尔多斯市","呼伦贝尔市","巴彦淖尔市","乌兰察布市","兴安盟","锡林郭勒盟","阿拉善盟"],"辽宁省": ["沈阳市","大连市","鞍山市","抚顺市","本溪市","丹东市","锦州市","营口市","阜新市","辽阳市","盘锦市","铁岭市","朝阳市","葫芦岛市"],"吉林省": ["长春市","吉林市","四平市","辽源市","通化市","白山市","松原市","白城市","延边朝鲜族自治州"],"黑龙江省": ["哈尔滨市","齐齐哈尔市","鸡西市","鹤岗市","双鸭山市","大庆市","伊春市","佳木斯市","七台河市","牡丹江市","黑河市","绥化市","大兴安岭地区"],"上海市": ["上海市"],"江苏省": ["南京市","无锡市","徐州市","常州市","苏州市","南通市","连云港市","淮安市","盐城市","扬州市","镇江市","泰州市","宿迁市"],"浙江省": ["杭州市","宁波市","温州市","嘉兴市","湖州市","绍兴市","金华市","衢州市","舟山市","台州市","丽水市"],"安徽省": ["合肥市","芜湖市","蚌埠市","淮南市","马鞍山市","淮北市","铜陵市","安庆市","黄山市","滁州市","阜阳市","宿州市","巢湖市","六安市","亳州市","池州市","宣城市"],"福建省": ["福州市","厦门市","莆田市","三明市","泉州市","漳州市","南平市","龙岩市","宁德市"],"江西省": ["南昌市","景德镇市","萍乡市","九江市","新余市","鹰潭市","赣州市","吉安市","宜春市","抚州市","上饶市"],"山东省": ["济南市","青岛市","淄博市","枣庄市","东营市","烟台市","潍坊市","济宁市","泰安市","威海市","日照市","莱芜市","临沂市","德州市","聊城市","滨州市","荷泽市"],"河南省": ["郑州市","开封市","洛阳市","平顶山市","安阳市","鹤壁市","新乡市","焦作市","濮阳市","许昌市","漯河市","三门峡市","南阳市","商丘市","信阳市","周口市","驻马店市"],"湖北省": ["武汉市","黄石市","十堰市","宜昌市","襄樊市","鄂州市","荆门市","孝感市","荆州市","黄冈市","咸宁市","随州市","恩施土家族苗族自治州","省直辖行政单位"],"湖南省": ["长沙市","株洲市","湘潭市","衡阳市","邵阳市","岳阳市","常德市","张家界市","益阳市","郴州市","永州市","怀化市","娄底市","湘西土家族苗族自治州"],"广东省": ["广州市","韶关市","深圳市","珠海市","汕头市","佛山市","江门市","湛江市","茂名市","肇庆市","惠州市","梅州市","汕尾市","河源市","阳江市","清远市","东莞市","中山市","潮州市","揭阳市","云浮市"],"广西壮族自治区": ["南宁市","柳州市","桂林市","梧州市","北海市","防城港市","钦州市","贵港市","玉林市","百色市","贺州市","河池市","来宾市","崇左市"],"海南省": ["海口市","三亚市"],"重庆市": ["重庆市"],"四川省": ["成都市","自贡市","攀枝花市","泸州市","德阳市","绵阳市","广元市","遂宁市","内江市","乐山市","南充市","眉山市","宜宾市","广安市","达州市","雅安市","巴中市","资阳市","阿坝藏族羌族自治州","甘孜藏族自治州","凉山彝族自治州"],"贵州省": ["贵阳市","六盘水市","遵义市","安顺市","铜仁地区","黔西南布依族苗族自治州","毕节地区","黔东南苗族侗族自治州","黔南布依族苗族自治州"],"云南省": ["昆明市","曲靖市","玉溪市","保山市","昭通市","丽江市","思茅市","临沧市","楚雄彝族自治州","红河哈尼族彝族自治州","文山壮族苗族自治州","西双版纳傣族自治州","大理白族自治州","德宏傣族景颇族自治州","怒江傈僳族自治州","迪庆藏族自治州"],"西藏自治区": ["拉萨市","昌都地区","山南地区","日喀则地区","那曲地区","阿里地区","林芝地区"],"陕西省": ["西安市","铜川市","宝鸡市","咸阳市","渭南市","延安市","汉中市","榆林市","安康市","商洛市"],"甘肃省": ["兰州市","嘉峪关市","金昌市","白银市","天水市","武威市","张掖市","平凉市","酒泉市","庆阳市","定西市","陇南市","临夏回族自治州","甘南藏族自治州"],"青海省": ["西宁市","海东地区","海北藏族自治州","黄南藏族自治州","海南藏族自治州","果洛藏族自治州","玉树藏族自治州","海西蒙古族藏族自治州"],"宁夏回族自治区": ["银川市","石嘴山市","吴忠市","固原市","中卫市"],"新疆维吾尔自治区": ["乌鲁木齐市","克拉玛依市","吐鲁番地区","哈密地区","昌吉回族自治州","博尔塔拉蒙古自治州","巴音郭楞蒙古自治州","阿克苏地区","克孜勒苏柯尔克孜自治州","喀什地区","和田地区","伊犁哈萨克自治州","塔城地区","阿勒泰地区","石河子市"]}

const natural_division = {
    "寒温带": {
        "湿润地区": ["ⅠA1 大兴安岭"]
    },
    "中温带": {
        "湿润地区": ["ⅡA1 三江平原", "ⅡA2 东北东部山地", "ⅡA3 东北东部山前平原"],
        "半湿润地区": ["ⅡB1 松辽平原中部", "ⅡB2 大兴安岭南部", "ⅡB3 三河山麓平原丘陵"],
        "半干旱地区": ["ⅡC1 松辽平原西南部", "ⅡC2 大兴安岭南部", "ⅡC3 内蒙古高平原东部"],
        "干旱地区": ["ⅡD1 内蒙古高平原西部及河套", "ⅡD2 阿拉善及河西走廊", "ⅡD3 准噶尔盆地", "ⅡD4 阿尔泰山与塔城盆地", "ⅡD5 伊犁盆地"]
    },
    "暖温带": {
        "湿润地区": ["ⅢA1 辽东胶东山地丘陵"],
        "半湿润地区": ["ⅢB1 鲁中山地丘陵", "ⅢB2 华北平原", "ⅢB3 华北山地丘陵", "ⅢB4 晋南关中盆地"],
        "半干旱地区": ["ⅢC1 晋中陕北甘东高原丘陵"],
        "干旱地区": ["ⅢD1 塔里木与吐鲁番盆地"]
    },
    "北亚热带": {
        "湿润地区": ["ⅣA1 淮南与长江中下游", "ⅣA2 汉中盆地"]
    },
    "中亚热带": {
        "湿润地区": ["ⅤA1 江南丘陵", "ⅤA2 江南与南岭山地", "ⅤA3 贵州高原", "ⅤA4 四川盆地", "ⅤA5 云南高原", "ⅤA6 东喜马拉雅南翼"]
    },
    "南亚热带": {
        "湿润地区": ["ⅥA1 台湾中北部山地平原", "ⅥA2 闽粤桂丘陵平原", "ⅥA3 滇中山地丘陵"]
    },
    "边缘热带": {
        "湿润地区": ["ⅦA1 台湾南部低地", "ⅦA2 琼雷山地丘陵", "ⅦA3 滇南谷地丘陵"]
    },
    "中 热 带": {
        "湿润地区": ["ⅧA1琼雷低地与东沙、中沙、西沙诸岛"]
    },
    "赤道热带": {
        "湿润地区": ["ⅨA1 南沙群岛"]
    },
    "高原亚寒带": {
        "半湿润地区": ["HⅠB1 果洛那曲丘状高原"],
        "半干旱地区": ["HⅠC1 青南高原宽谷", "HⅠC2 羌塘高原湖盆"],
        "干旱地区": ["HⅠD1 昆仑高山高原"]        
    },
    "高原温带": {
        "湿润/半湿润地区": ["HⅡA/B1 川西藏东高山深谷"],
        "半干旱地区": ["HⅡC1 青东祁连山地", "HⅡC2 藏南山地"],
        "干旱地区": ["HⅡD1 柴达木盆地", "HⅡD2 昆仑山北翼", "HⅡD3 阿里山地"]
    }
}

const climate_division = {
    "I 北温带": ["ⅠA1根河区"],
    "II 中温带": ["ⅡC5伊宁区", "ⅡC5伊宁区", "ⅡC3富蕴区", "ⅡC4塔城区", "ⅡC1蒙东区", "ⅡC2蒙中区", "ⅡA1小兴安岭区", "ⅡB1大兴安岭区", "ⅡC1蒙东区", "ⅡD1蒙甘区", "ⅡD2北疆区", "ⅡA2三江-长白区", "ⅡB2松辽区"],
    "III 南温带": ["ⅢD1南疆区", "ⅢC1晋陕甘区", "ⅢB1河北区", "ⅢB3渭河区", "ⅢA1辽东-胶东半岛区", "ⅢB1河北区", "ⅢB2鲁淮区"],
    "IV 北亚热带": ["ⅣA2秦巴区", "ⅣA1江北区"],
    "V 中亚热带": ["VA2瓯江、闽江、南岭区", "VA1江南区", "VA3四川区", "VA4贵州区", "VB1金沙江-楚雄、玉溪区", "VA5滇北区"],
    "VI 南亚热带": ["VIA1台北区", "VIA2闽南-珠江区", "VIA3滇南区"],
    "VII 北亚热带": ["VIIA2雷琼区", "VIIA1台南区", "VIIB1琼西区", "VIIA3滇南河谷区", "VIIA3滇南河谷区", "VIIC1元江区", "VIIA1台南区"],
    "VIII 中热带": ["VIIIA1琼南-西沙区"],
    "IX 南热带": ["IXA1南沙区"],
    "H 高原气候区": ["HD2藏北区", "HC3藏南区", "HC2藏中区", "HB2昌都区", "HA1波密-川西区", "HVVIVIIA1达旺-察隅区", "HC1祁连-青海湖区", "HB1青南区", "HD1柴达木区"]
}

const vegetation_division = {
    "寒温带针叶林区域": ["南寒温带落叶针叶林地带"],
    "暖温带落叶阔叶林区域": ["暖温带南部落叶栎林亚地带", "暖温带北部落叶栎林地带"],
    "青藏高原高寒植被区域": ["高寒草原地带", "高寒灌丛，草甸地带", "高寒草甸地带", "高寒荒漠地带", "温性荒漠地带", "温性草原地带"],
    "热带季风雨林、雨林区域": ["北热带季节雨林、半常绿季", "北热带半常绿季雨林、湿润", "南热带季雨林、湿润雨林地", "北热带半常绿季雨林、湿润"],
    "温带草原区域": ["温带南部森林（草甸）草原", "温带南部荒漠草原亚地带", "温带南部典型草原亚地带", "温带北部草甸草原亚地带", "温带北部典型草原亚地带", "温带北部荒漠草原亚地带", "温带北部荒漠草原亚地带"],
    "温带荒漠区域": ["暖温带灌木、半灌木、裸露", "暖温带灌木、半灌木荒漠亚", "温带灌木、禾草半荒漠亚地", "温带灌木、半灌木荒漠亚地", "温带半灌木，灌木荒漠地带", "温带半灌木、矮乔木荒漠地"],
    "温带针叶、落叶阔叶混交林": ["温带南部针叶、落叶阔叶混", "温带北部针叶、落叶阔叶混"],
    "亚热带常绿阔叶林区域": ["亚热带山地寒温性针叶林地", "中亚热带常绿阔叶林地带", "南亚热带季风常绿阔叶林地", "南亚热带季风常绿阔叶林地", "中亚热带常绿阔叶林北部亚", "北亚热带常绿、落叶阔叶混", "中亚热带常绿阔叶林南部亚", "南亚热带季风常绿阔叶林地"]
}

const urban_agglomeration = {
    "汾渭平原": ["吕梁市", "西安市", "运城市", "渭南市", "咸阳市", "临汾市", "铜川市", "宝鸡市", "晋中市", "三门峡市", "洛阳市"],
    "长三角地区": ["衢州市", "金华市", "温州市", "湖州市", "丽水市", "台州市", "嘉兴市", "马鞍山市", "芜湖市", "池州市", "宁波市", "绍兴市", "宿迁市", "杭州市", "舟山市", "亳州市", "宿州市", "安庆市", "淮安市", "黄山市", "徐州市", "淮南市", "镇江市", "无锡市", "铜陵市", "泰州市", "合肥市", "上海市", "蚌埠市", "宣城市", "常州市", "南京市", "扬州市", "淮北市", "滁州市", "苏州市", "盐城市", "阜阳市", "连云港市", "六安市", "南通市"],
    "京津冀及周边(2+26)地区": ["邯郸市", "沧州市", "济宁市", "衡水市", "北京市", "晋城市", "唐山市", "长治市", "邢台市", "济南市", "天津市", "聊城市", "石家庄市", "太原市", "滨州市", "菏泽市", "淄博市", "焦作市", "德州市", "郑州市", "阳泉市", "新乡市", "鹤壁市", "保定市", "安阳市", "廊坊市", "开封市", "濮阳市"],
    "京津冀地区": ["北京市", "天津市", "张家口市", "承德市", "保定市", "廊坊市", "唐山市", "石家庄市", "衡水市", "沧州市", "邢台市", "邯郸市", "秦皇岛市"],
    "京津冀及周边(2+31)地区": ["邯郸市", "沧州市", "济宁市", "衡水市", "北京市", "晋城市", "唐山市", "长治市", "邢台市", "济南市", "天津市", "聊城市", "石家庄市", "太原市", "滨州市", "菏泽市", "淄博市", "焦作市", "德州市", "郑州市", "阳泉市", "新乡市", "鹤壁市", "保定市", "安阳市", "廊坊市", "开封市", "濮阳市", "张家口市", "承德市", "秦皇岛市", "泰安市", "莱芜市"],
    "京津冀及汾渭平原(2+43)地区": ["邯郸市", "沧州市", "济宁市", "衡水市", "北京市", "晋城市", "唐山市", "长治市", "邢台市", "济南市", "天津市", "聊城市", "石家庄市", "太原市", "滨州市", "菏泽市", "淄博市", "焦作市", "德州市", "郑州市", "阳泉市", "新乡市", "鹤壁市", "保定市", "安阳市", "廊坊市", "开封市", "濮阳市", "张家口市", "承德市", "秦皇岛市", "泰安市", "莱芜市", "吕梁市", "西安市", "运城市", "渭南市", "咸阳市", "临汾市", "铜川市", "宝鸡市", "晋中市", "三门峡市", "洛阳市", "晋城市", "延安市"],
    "珠三角地区": ["广州市", "佛山市", "肇庆市", "深圳市", "东莞市", "惠州市", "珠海市", "中山市", "江门市"],
    "成渝城市群": ["重庆市", "成都市", "自贡市", "泸州市", "德阳市", "绵阳市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "资阳市"]
}

export {
    province_city,
    natural_division,
    climate_division,
    vegetation_division,
    urban_agglomeration
}
